In [24]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

In [25]:
import csv

data = []

with open('Practice_Day_15_5.csv', 'r', newline='', encoding='utf-8') as f:
    reader = csv.reader(f)
    header = next(reader)
    n_cols = len(header)
    for row in reader:
        while len(row) < n_cols:
            row.append(pd.NA)
        if len(row) > n_cols:
            row = row[:n_cols]
        data.append(row)

df = pd.DataFrame(data, columns=header)
df

   EmployeeID EmployeeName Age Salary  Price Marks1 Marks2 Marks3
0        E101        Alice  25  50000   1200     85     90     88
1        E102          Bob  30         60000   1500     78     82
2        E103      Charlie  22  52000   1100     92     95     90
3        E101        Alice  25  50000   1200     85     90     88
4        E104        David  45  80000   2500     88     85     89
5        E105          Eve  29  58000   1300     76     79     81
6        E106        Frank      75000   2200     90     91     92
7        E107        Grace  34          1900     81     83     80
8        E108        Heidi  38          1800     84     86     88
9        E109         Ivan  26  53000   1400     95     92     94
10       E102          Bob  30         60000   1500     78     82

In [32]:
df['Price'] = pd.to_numeric(df['Price'])

dis = df['Price'] * 0.10

df['Discounted_Price'] = df['Price'] - dis

df

,EmployeeID,EmployeeName,Age,Salary,Price,Marks1,Marks2,Marks3,Discounted_Price
0,E101,Alice,25,50000,1200,85,90,88,1080.0
1,E102,Bob,30,,60000,1500,78,82,54000.0
2,E103,Charlie,22,52000,1100,92,95,90,990.0
3,E101,Alice,25,50000,1200,85,90,88,1080.0
4,E104,David,45,80000,2500,88,85,89,2250.0
5,E105,Eve,29,58000,1300,76,79,81,1170.0
6,E106,Frank,,75000,2200,90,91,92,1980.0
7,E107,Grace,34,,1900,81,83,80,1710.0
8,E108,Heidi,38,,1800,84,86,88,1620.0
9,E109,Ivan,26,53000,1400,95,92,94,1260.0
10,E102,Bob,30,,60000,1500,78,82,54000.0

In [33]:
df.to_csv('discounted_products.csv')

In [34]:
df['EmployeeID'].duplicated().sum()

np.int64(2)

In [38]:
df_clean = df.drop_duplicates(subset='EmployeeID')

df_clean

,EmployeeID,EmployeeName,Age,Salary,Price,Marks1,Marks2,Marks3,Discounted_Price
0,E101,Alice,25,50000,1200,85,90,88,1080.0
1,E102,Bob,30,,60000,1500,78,82,54000.0
2,E103,Charlie,22,52000,1100,92,95,90,990.0
4,E104,David,45,80000,2500,88,85,89,2250.0
5,E105,Eve,29,58000,1300,76,79,81,1170.0
6,E106,Frank,,75000,2200,90,91,92,1980.0
7,E107,Grace,34,,1900,81,83,80,1710.0
8,E108,Heidi,38,,1800,84,86,88,1620.0
9,E109,Ivan,26,53000,1400,95,92,94,1260.0

In [42]:
df = pd.read_csv('discounted_products.csv')

df

,Unnamed: 0,EmployeeID,EmployeeName,Age,Salary,Price,Marks1,Marks2,Marks3,Discounted_Price
0,0,E101,Alice,25.0,50000.0,1200,85,90,88,1080.0
1,1,E102,Bob,30.0,NaN,60000,1500,78,82,54000.0
2,2,E103,Charlie,22.0,52000.0,1100,92,95,90,990.0
3,3,E101,Alice,25.0,50000.0,1200,85,90,88,1080.0
4,4,E104,David,45.0,80000.0,2500,88,85,89,2250.0
5,5,E105,Eve,29.0,58000.0,1300,76,79,81,1170.0
6,6,E106,Frank,NaN,75000.0,2200,90,91,92,1980.0
7,7,E107,Grace,34.0,NaN,1900,81,83,80,1710.0
8,8,E108,Heidi,38.0,NaN,1800,84,86,88,1620.0
9,9,E109,Ivan,26.0,53000.0,1400,95,92,94,1260.0
10,10,E102,Bob,30.0,NaN,60000,1500,78,82,54000.0

In [43]:
df['Age'].isnull().sum()

np.int64(1)

In [44]:
df['Salary'].isna().sum()

np.int64(4)

In [51]:
df['Age'] = df['Age'].fillna(df['Age'].mean())

df

,Unnamed: 0,EmployeeID,EmployeeName,Age,Salary,Price,Marks1,Marks2,Marks3,Discounted_Price
0,0,E101,Alice,25.0,50000.0,1200,85,90,88,1080.0
1,1,E102,Bob,30.0,NaN,60000,1500,78,82,54000.0
2,2,E103,Charlie,22.0,52000.0,1100,92,95,90,990.0
3,3,E101,Alice,25.0,50000.0,1200,85,90,88,1080.0
4,4,E104,David,45.0,80000.0,2500,88,85,89,2250.0
5,5,E105,Eve,29.0,58000.0,1300,76,79,81,1170.0
6,6,E106,Frank,30.4,75000.0,2200,90,91,92,1980.0
7,7,E107,Grace,34.0,NaN,1900,81,83,80,1710.0
8,8,E108,Heidi,38.0,NaN,1800,84,86,88,1620.0
9,9,E109,Ivan,26.0,53000.0,1400,95,92,94,1260.0
10,10,E102,Bob,30.0,NaN,60000,1500,78,82,54000.0

In [53]:
df = df.dropna(subset=['Salary'])

df

,Unnamed: 0,EmployeeID,EmployeeName,Age,Salary,Price,Marks1,Marks2,Marks3,Discounted_Price
0,0,E101,Alice,25.0,50000.0,1200,85,90,88,1080.0
2,2,E103,Charlie,22.0,52000.0,1100,92,95,90,990.0
3,3,E101,Alice,25.0,50000.0,1200,85,90,88,1080.0
4,4,E104,David,45.0,80000.0,2500,88,85,89,2250.0
5,5,E105,Eve,29.0,58000.0,1300,76,79,81,1170.0
6,6,E106,Frank,30.4,75000.0,2200,90,91,92,1980.0
9,9,E109,Ivan,26.0,53000.0,1400,95,92,94,1260.0